<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted'             => 'این فیلد باید پذیرفته شده باشد.',
    'active_url'           => 'آدرس مورد نظر معتبر نیست',
    'after'                => 'فیلد مورد نظر باید تاریخی بعد از :date باشد.',
    'after_or_equal'       => 'فیلد مورد نظر باید تاریخی بعد از :date، یا مطابق با آن باشد.',
    'alpha'                => 'فیلد مورد نظر باید فقط حروف الفبا باشد.',
    'alpha_dash'           => 'فیلد مورد نظر باید فقط حروف الفبا، عدد و خط تیره(-) باشد.',
    'alpha_num'            => 'فیلد مورد نظر باید فقط حروف الفبا و عدد باشد.',
    'array'                => 'فیلد مورد نظر باید آرایه باشد.',
    'before'               => 'فیلد مورد نظر باید تاریخی قبل از :date باشد.',
    'before_or_equal'      => 'فیلد مورد نظر باید تاریخی قبل از :date، یا مطابق با آن باشد.',
    'between'              => [
        'numeric' => 'فیلد مورد نظر باید بین :min و :max باشد.',
        'file'    => 'فیلد مورد نظر باید بین :min و :max کیلوبایت باشد.',
        'string'  => 'فیلد مورد نظر باید بین :min و :max کاراکتر باشد.',
        'array'   => 'فیلد مورد نظر باید بین :min و :max آیتم باشد.',
    ],
    'boolean'              => 'فیلد مورد نظر فقط می‌تواند صفر و یا یک باشد',
    'confirmed'            => 'فیلد مورد نظر با فیلد تکرار مطابقت ندارد.',
    'date'                 => 'فیلد مورد نظر یک تاریخ معتبر نیست.',
    'date_format'          => 'فیلد مورد نظر با الگوی :format مطاقبت ندارد.',
    'different'            => 'فیلد مورد نظر و :other باید متفاوت باشند.',
    'digits'               => 'فیلد مورد نظر باید :digits رقم باشد.',
    'digits_between'       => 'فیلد مورد نظر باید بین :min و :max رقم باشد.',
    'dimensions'           => 'ابعاد تصویر فیلد مورد نظر قابل قبول نیست.',
    'distinct'             => 'فیلد مورد نظر تکراری است.',
    'email'                => 'فیلد مورد نظر باید یک ایمیل معتبر باشد',
    'exists'               => 'فیلد مورد نظر انتخاب شده، معتبر نیست.',
    'file'                 => 'فیلد مورد نظر باید یک فایل باشد',
    'filled'               => 'فیلد مورد نظر الزامی است',
    'image'                => 'فیلد مورد نظر باید تصویر باشد.',
    'in'                   => 'فیلد مورد نظر انتخاب شده، معتبر نیست.',
    'in_array'             => 'فیلد مورد نظر در :other وجود ندارد.',
    'integer'              => 'فیلد مورد نظر باید عدد صحیح باشد.',
    'ip'                   => 'فیلد مورد نظر باید IP معتبر باشد.',
    'ipv4'                 => 'فیلد مورد نظر باید یک آدرس معتبر از نوع IPv4 باشد.',
    'ipv6'                 => 'فیلد مورد نظر باید یک آدرس معتبر از نوع IPv6 باشد.',
    'json'                 => 'فیلد مورد نظر باید یک رشته از نوع JSON باشد.',
    'max'                  => [
        'numeric' => 'فیلد مورد نظر نباید بزرگتر از :max باشد.',
        'file'    => 'فیلد مورد نظر نباید بزرگتر از :max کیلوبایت باشد.',
        'string'  => 'فیلد مورد نظر نباید بیشتر از :max کاراکتر باشد.',
        'array'   => 'فیلد مورد نظر نباید بیشتر از :max آیتم باشد.',
    ],
    'mimes'                => 'فیلد مورد نظر باید یکی از فرمت های :values باشد.',
    'mimetypes'            => 'فیلد مورد نظر باید یکی از فرمت های :values باشد.',
    'min'                  => [
        'numeric' => 'فیلد مورد نظر نباید کوچکتر از :min باشد.',
        'file'    => 'فیلد مورد نظر نباید کوچکتر از :min کیلوبایت باشد.',
        'string'  => 'فیلد مورد نظر نباید کمتر از :min کاراکتر باشد.',
        'array'   => 'فیلد مورد نظر نباید کمتر از :min آیتم باشد.',
    ],
    'not_in'               => 'فیلد مورد نظر انتخاب شده، معتبر نیست.',
    'numeric'              => 'فیلد مورد نظر باید عدد باشد.',
    'present'              => 'فیلد مورد نظر باید در پارامترهای ارسالی وجود داشته باشد.',
    'regex'                => 'فرمت فیلد مورد نظر معتبر نیست',
    'required'             => 'فیلد مورد نظر الزامی است',
    'required_if'          => 'هنگامی که :other برابر با :value است، فیلد مورد نظر الزامی است.',
    'required_unless'      => 'فیلد مورد نظر ضروری است، مگر آنکه :other در :values موجود باشد.',
    'required_with'        => 'در صورت وجود فیلد :values، فیلد مورد نظر الزامی است.',
    'required_with_all'    => 'در صورت وجود فیلدهای :values، فیلد مورد نظر الزامی است.',
    'required_without'     => 'در صورت عدم وجود فیلد :values، فیلد مورد نظر الزامی است.',
    'required_without_all' => 'در صورت عدم وجود هر یک از فیلدهای :values، فیلد مورد نظر الزامی است.',
    'same'                 => 'فیلد مورد نظر و :other باید مانند هم باشند.',
    'size'                 => [
        'numeric' => 'فیلد مورد نظر باید برابر با :size باشد.',
        'file'    => 'فیلد مورد نظر باید برابر با :size کیلوبایت باشد.',
        'string'  => 'فیلد مورد نظر باید برابر با :size کاراکتر باشد.',
        'array'   => 'فیلد مورد نظر باید شامل :size آیتم باشد.',
    ],
    'string'               => 'فیلد مورد نظر باید متن باشد.',
    'timezone'             => 'فیلد مورد نظر باید یک منطقه زمانی قابل قبول باشد.',
    'unique'               => 'فیلد مورد نظر قبلا انتخاب شده است.',
    'uploaded'             => 'آپلود فایل مورد نظر موفقیت آمیز نبود.',
    'url'                  => 'فرمت آدرس مورد نظر اشتباه است.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap attribute place-holders
    | with something more reader friendly such as E-Mail Address instead
    | of "email". This simply helps us make messages a little cleaner.
    |
    */

    'attributes'           => [
        'name'                  => 'نام',
        'national_code'         => 'کد ملی',
        'mobile'                => 'شماره موبایل',
        'current_password'      => 'رمز عبور قبلی',
        'message'               => 'سوال شما',
        'username'              => 'نام کاربری',
        'email'                 => 'ایمیل',
        'first_name'            => 'نام',
        'last_name'             => 'نام خانوادگی',
        'password'              => 'رمز عبور',
        'password_confirmation' => 'تکرار رمز عبور',
        'address_title'         => 'عنوان آدرس',
        'city'                  => 'شهر',
        'country'               => 'کشور',
        'address'               => 'آدرس پستی',
        'phone'                 => 'شماره ثابت',
        'cellphone'             => 'شماره همراه',
        'age'                   => 'سن',
        'sex'                   => 'جنسیت',
        'gender'                => 'جنسیت',
        'day'                   => 'روز',
        'month'                 => 'ماه',
        'year'                  => 'سال',
        'hour'                  => 'ساعت',
        'minute'                => 'دقیقه',
        'second'                => 'ثانیه',
        'title'                 => 'عنوان',
        'text'                  => 'متن',
        'content'               => 'محتوا',
        'description'           => 'توضیحات',
        'excerpt'               => 'گزیده مطلب',
        'date'                  => 'تاریخ',
        'time'                  => 'زمان',
        'available'             => 'موجود',
        'size'                  => 'اندازه',
        'terms'                 => 'شرایط',
        'price'                 => 'قیمت',
        'code'                  => 'کد',
        'score'                 => 'تعداد امتیاز',
        'display_name'          => 'نام نمایشی',
        'resource'              => 'نام ریسورس',
        'old_password'          => 'رمز عبور فعلی',
        'newpassword'           => 'رمز عبور جدید',
        'newpassword_confirmation' => 'تکرار رمز عبور جدید',
        'longitude'             => 'طول جغرافیایی',
        'latitude'              => 'عرض جغرافیایی',
    ],

];
